src/Documents/ИзменениеЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ИзменениеЦен</Name>
			<Comment>Изменение цен компании и контрагентов</Comment>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваров</xr:Item>
				<xr:Item>Document.ВводОстатковТоваров</xr:Item>
				<xr:Item>Document.АвансовыйОтчет</xr:Item>
				<xr:Item>Document.ПеремещениеТоваров</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Document.СогласованиеЗакупочныхЦен</xr:Item>
				<xr:Item>Catalog.ПрайсЛистыКонтрагентов</xr:Item>
				<xr:Item>Document.МониторингЦенКонкурентов</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияДокументов</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТоваровКомпании</xr:Item>
				<xr:Item>InformationRegister.Цены</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Поставщик товара, для которого регистрируются цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазовыйТипЦен</Name>
					<Comment>Тип цен, относительно которого производится расчет</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.СогласованиеЗакупочныхЦен</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.МониторингЦенКонкурентов</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеФорматовПодразделения</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеАссортиментаФорматов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Comment>Поставщик, от цен которого рассчитываем новые цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании на котором хранятся товары (в случае если расчет цен идет от себестоимости товаров)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрайсЛистКонтрагента</Name>
					<Comment>Прайс-лист контрагента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрайсЛистыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Comment>Дата начала действия цены</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпанииПолучатель</Name>
					<Comment>Подразделение компании, для которого назначаются цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазовоеПодразделение</Name>
					<Comment>Базовое подразделение</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ит_ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<Comment>Товары цены которых надо изменить</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипЦен</Name>
							<Comment>Устанавливаемый тип цен</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура (товар, услуга и т.п.)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>Единица измерения номенклатурной позиции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>Новая цена номенклатурной позиции</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаБазовая</Name>
							<Comment>Базовая цена</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентНаценки</Name>
							<Comment>Наценка на базовую цену для вычисления устанавливаемой цены</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>Характеристика/серия номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазоваяЕдиницаИзмерения</Name>
							<Comment>Базовая единица измерения</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНаценки</Name>
							<Comment>Сумма наценки на базовую цену</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыРасчета</Name>
					<Comment>Параметры расчета цен</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипЦен</Name>
							<Comment>Устанавливаемый тип цен</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасчетЦенОт</Name>
							<Comment>Признак того, относительно чего производится расчет цен</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентНаценки</Name>
							<Comment>Процент наценки на базовую цену</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентНаценкиИзНоменклатуры</Name>
							<Comment>Использовать процент наценки, указанный в карточке номенклатуры</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентНаценкиИзРекомендуемых</Name>
							<Comment>Использовать рекомендуемый процент наценки</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкруглятьДо</Name>
							<Comment>Округлять расчетную цену до... (знаков после запятой)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкруглениеИзТипаЦены</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
					<Comment>Набор реквизитов, состав которого определяется компанией</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТипыЦенГрупповойУстановки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипЦен</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ИзменениеЦен/Forms/ФормаНастройкиТиповЦен/Ext/Form/Module.bsl
// Модуль произвольной формы документа "Изменение цен"


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА

// Производит настройку параметров отображения элементов управления диалога в зависимости от значений реквизитов
// объекта.
//
&НаСервере
Процедура УправлениеДиалогомНаСервере()
	
	// Вызываем общий обработчик действия
	//УправлениеДиалогомДокументаСервер.УправлениеДиалогомНаСервере(ЭтотОбъект);
	
	Элементы.ДеревоТиповЦенУстановитьФлажки.Доступность = НЕ ТолькоОдинТипЦен;
	
КонецПроцедуры // УправлениеДиалогомНаСервере()

// Настройка условного оформления формы
//
&НаСервере
Процедура УстановитьУсловноеОформление()
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаСервер.УстановитьУсловноеОформление(ЭтотОбъект);
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТаблицаТиповЦенВалюта");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаТиповЦен.Валюта");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<В валюте товара>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
	
КонецПроцедуры // УстановитьУсловноеОформление()

&НаСервере
Процедура ЗаполнитьДеревоТиповЦен()
	
	СписокВыбранныхТиповЦен = ПолучитьЗначениеПараметраСтруктуры(Параметры, "СписокТиповЦен", Неопределено);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТипыЦен.Ссылка КАК ТипЦен
	                      |ПОМЕСТИТЬ ТаблицаТиповЦен
	                      |ИЗ
	                      |	Справочник.ТипыЦен КАК ТипыЦен
	                      |ГДЕ
	                      |	ТипыЦен.Ссылка В(&СписокТиповЦен)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТипыЦен.Ссылка КАК ТипЦен,
	                      |	ТипыЦен.ВалютаЦены КАК Валюта,
	                      |	ТипыЦен.ЦенаВключаетНДС КАК ВключаетНДС,
	                      |	ТипыЦен.ЭтоГруппа КАК ЭтоГруппа,
	                      |	ВЫБОР
	                      |		КОГДА ТаблицаТиповЦен.ТипЦен ЕСТЬ NULL
	                      |			ТОГДА ЛОЖЬ
	                      |		ИНАЧЕ ИСТИНА
	                      |	КОНЕЦ КАК Пометка
	                      |ИЗ
	                      |	Справочник.ТипыЦен КАК ТипыЦен
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаТиповЦен КАК ТаблицаТиповЦен
	                      |		ПО ТипыЦен.Ссылка = ТаблицаТиповЦен.ТипЦен
	                      |ГДЕ
	                      |	НЕ ТипыЦен.ПометкаУдаления
	                      |	И ТипыЦен.Продажа
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ТипыЦен.Ссылка ИЕРАРХИЯ
	                      |АВТОУПОРЯДОЧИВАНИЕ");
	Запрос.УстановитьПараметр("СписокТиповЦен", СписокВыбранныхТиповЦен);
	
	//РезультатЗапроса = Запрос.Выполнить();
	//ОбходДереваТиповЦен(Элементы.ДеревоТиповЦен, ДеревоТиповЦен.ПолучитьЭлементы(), РезультатЗапроса);
	Дерево = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ЗначениеВРеквизитФормы(Дерево, "ДеревоТиповЦен");

КонецПроцедуры //ЗаполнитьДеревоТиповЦен()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// Обработчик события нажатия кнопки "Применить".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Применить(Команда)
	
	Результат = Новый Структура;
	
	Если НЕ РежимВыбораТиповЦен Тогда
		РезультатКолонки = Новый Массив;
		
		Если ЕдиницаИзмерения = Истина Тогда
			РезультатКолонки.Добавить("ЕдиницаИзмерения");
		КонецЕсли;
		Если СтараяЦена = Истина Тогда
			РезультатКолонки.Добавить("ЦенаСтарая");
		КонецЕсли;
		Если СтарыйПроцентНаценки = Истина Тогда
			РезультатКолонки.Добавить("СтарыйПроцентНаценки");
		КонецЕсли;
		Если НоваяЦена = Истина Тогда
			РезультатКолонки.Добавить("ЦенаНовая");
		КонецЕсли;
		Если БазоваяЦена = Истина Тогда
			РезультатКолонки.Добавить("ЦенаБазовая");
		КонецЕсли;
		Если ПроцентНаценки = Истина Тогда
			РезультатКолонки.Добавить("ПроцентНаценки");
		КонецЕсли;
		// тк+
		Если РекомендуемыйПроцентНаценки = Истина Тогда
			РезультатКолонки.Добавить("РекомендуемыйПроцентНаценки");
		КонецЕсли;
		// тк-
		Если СуммаНаценки = Истина Тогда
			РезультатКолонки.Добавить("СуммаНаценки");
		КонецЕсли;
		Если ЦенаКонкурента = Истина Тогда
			РезультатКолонки.Добавить("ЦенаКонкурента");
		КонецЕсли;
		
		Результат.Вставить("РезультатКолонки", РезультатКолонки);
		
	КонецЕсли;
	СписокТиповЦены = Новый СписокЗначений;
	
	//Для Каждого ТекущаяСтрока Из ТаблицаТиповЦен Цикл
	//	Если ТекущаяСтрока.Пометка Тогда
	//		СписокТиповЦены.Добавить(ТекущаяСтрока.ТипЦен);
	//	КонецЕсли;
	//КонецЦикла;
	
	ДеревоВСписокЗначений(ДеревоТиповЦен.ПолучитьЭлементы(), СписокТиповЦены);
	
	Результат.Вставить("ТекущийСписокТипЦен", СписокТиповЦены);
	
	Закрыть(Результат);
	
КонецПроцедуры // Применить()

&НаКлиенте
Процедура ДеревоВСписокЗначений(ВеткаДерева, СписокТиповЦены)
	
	Для Каждого ТекущаяСтрока Из ВеткаДерева Цикл
		Если ТекущаяСтрока.Пометка И НЕ ТекущаяСтрока.ЭтоГруппа Тогда
			СписокТиповЦены.Добавить(ТекущаяСтрока.ТипЦен);
		КонецЕсли;
		
		ДеревоВСписокЗначений(ТекущаяСтрока.ПолучитьЭлементы(), СписокТиповЦены);
	КонецЦикла;
	
КонецПроцедуры //ДеревоВСписокЗначений()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ДЕРЕВА ФОРМЫ "ТИПЫ ЦЕН"

&НаКлиенте
Процедура ДеревоТиповЦенВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДеревоТиповЦен.ТекущиеДанные;
	
	Если Элемент.ТекущийЭлемент.Имя = "ДеревоТиповЦенТипЦен" И ТекущиеДанные <> Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму("Справочник.ТипыЦен.ФормаОбъекта", Новый Структура("Ключ", ТекущиеДанные.ТипЦен), ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры //ДеревоТиповЦенВыбор()

&НаКлиенте
Процедура ДеревоТиповЦенУстановитьФлажкиРекурсивно(ВеткаДерева, Пометка)
	
	Для Каждого ТекущаяСтрока Из ВеткаДерева Цикл
		ТекущаяСтрока.Пометка = Пометка И НЕ ТекущаяСтрока.ЭтоГруппа;
		ДеревоТиповЦенУстановитьФлажкиРекурсивно(ТекущаяСтрока.ПолучитьЭлементы(), Пометка);
	КонецЦикла;
	
КонецПроцедуры //ДеревоТиповЦенУстановитьФлажкиРекурсивно()

&НаКлиенте
Процедура ДеревоТиповЦенУстановитьФлажки(Команда)
	
	ДеревоТиповЦенУстановитьФлажкиРекурсивно(ДеревоТиповЦен.ПолучитьЭлементы(), Истина);
	
КонецПроцедуры //ДеревоТиповЦенУстановитьФлажки()

&НаКлиенте
Процедура ДеревоТиповЦенСнятьФлажки(Команда)
	
	ДеревоТиповЦенУстановитьФлажкиРекурсивно(ДеревоТиповЦен.ПолучитьЭлементы(), Ложь);
	
КонецПроцедуры //ДеревоТиповЦенСнятьФлажки()

&НаКлиенте
Процедура ДеревоТиповЦенПометкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоТиповЦен.ТекущиеДанные;
	
	Если ТолькоОдинТипЦен Тогда
		
		Если ТекущиеДанные.ЭтоГруппа Тогда
			ТекущиеДанные.Пометка = Ложь;
			Возврат;
		КонецЕсли;
		
		Пометка = ТекущиеДанные.Пометка;
		
		ДеревоТиповЦенУстановитьФлажкиРекурсивно(ДеревоТиповЦен.ПолучитьЭлементы(), Ложь);
		
		ТекущиеДанные.Пометка = Пометка;
	Иначе
		Если ТекущиеДанные.Пометка Тогда
			Элементы.ДеревоТиповЦен.Развернуть(ТекущиеДанные.ПолучитьИдентификатор(), Истина);
		КонецЕсли;
		ДеревоТиповЦенУстановитьФлажкиРекурсивно(ТекущиеДанные.ПолучитьЭлементы(), ТекущиеДанные.Пометка);
	КонецЕсли;
	
	//не помечаем группы
	Если ТекущиеДанные.ЭтоГруппа Тогда
		ТекущиеДанные.Пометка = Ложь;
	КонецЕсли;
	
КонецПроцедуры //ДеревоТиповЦенПометкаПриИзменении()

&НаКлиенте
Процедура ДеревоРазвернуть(Команда)
	
	УправлениеДиалогомКлиент.ДеревоПодразделенийРазвернутьВсеУровни(Элементы.ДеревоТиповЦен, ДеревоТиповЦен.ПолучитьЭлементы());
	
КонецПроцедуры //ДеревоРазвернуть()

&НаКлиенте
Процедура ДеревоСвернуть(Команда)
	
	УправлениеДиалогомКлиент.ДеревоПодразделенийСвернутьВсеУровни(Элементы.ДеревоТиповЦен, ДеревоТиповЦен.ПолучитьЭлементы());
	
КонецПроцедуры //ДеревоСвернуть()

&НаКлиенте
Процедура ДеревоТиповЦенРазвернутьРодителя(ЭлементФормыДерево, Родитель)
	
	Если Родитель=Неопределено Тогда
		Возврат;
	Иначе
		ЭлементФормыДерево.Развернуть(Родитель.ПолучитьИдентификатор());
		ДеревоТиповЦенРазвернутьРодителя(ЭлементФормыДерево, Родитель.ПолучитьРодителя());
	КонецЕсли;
	
КонецПроцедуры //ДеревоГруппПоставокРазвернутьРодителя()

&НаКлиенте
Процедура ДеревоТиповЦенРазвернутьПомеченныеРекурсивно(ЭлементФормыДерево, ВеткаДерева, Пометка=Ложь)
	
	Для Каждого ТекущаяСтрока Из ВеткаДерева Цикл
		Если ТекущаяСтрока.Пометка Тогда
			ДеревоТиповЦенРазвернутьРодителя(ЭлементФормыДерево, ТекущаяСтрока.ПолучитьРодителя());
		КонецЕсли;
		
		ДеревоТиповЦенРазвернутьПомеченныеРекурсивно(ЭлементФормыДерево, ТекущаяСтрока.ПолучитьЭлементы());
	КонецЦикла;
	
КонецПроцедуры //ТипыЦенРазвернутьПомеченныеРекурсивно()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	РежимВыбораТиповЦен = ПолучитьЗначениеПараметраСтруктуры(Параметры, "РежимВыбораТиповЦен", Ложь);
	
	СписокВидимости = ПолучитьЗначениеПараметраСтруктуры(Параметры, "СписокВидимости", Неопределено);
	
	ТолькоОдинТипЦен = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ТолькоОдинТипЦен", Ложь);
	
	Если СписокВидимости<>Неопределено Тогда
		Для Каждого ТекВидимость Из СписокВидимости Цикл
			Если ТекВидимость.Значение = "ЕдиницаИзмерения" Тогда
				ЕдиницаИзмерения = Истина;
			ИначеЕсли ТекВидимость.Значение = "ЦенаСтарая" Тогда
				СтараяЦена = Истина;
			ИначеЕсли ТекВидимость.Значение = "СтарыйПроцентНаценки" Тогда
				СтарыйПроцентНаценки = Истина;
			ИначеЕсли ТекВидимость.Значение = "ЦенаНовая" Тогда
				НоваяЦена = Истина;
			ИначеЕсли ТекВидимость.Значение = "ЦенаБазовая" Тогда
				БазоваяЦена = Истина;
			ИначеЕсли ТекВидимость.Значение = "ПроцентНаценки" Тогда
				ПроцентНаценки = Истина;
			// тк+
			ИначеЕсли ТекВидимость.Значение = "РекомендуемыйПроцентНаценки" Тогда
				РекомендуемыйПроцентНаценки = Истина;
			// тк-
			ИначеЕсли ТекВидимость.Значение = "СуммаНаценки" Тогда
				СуммаНаценки = Истина;
			ИначеЕсли ТекВидимость.Значение = "ЦенаКонкурента" Тогда
				ЦенаКонкурента = Истина;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Элементы.ГруппаВидимостьКолонок.Видимость = Ложь;
	КонецЕсли;
	
	ЗаполнитьДеревоТиповЦен();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ДеревоТиповЦенРазвернутьПомеченныеРекурсивно(Элементы.ДеревоТиповЦен, ДеревоТиповЦен.ПолучитьЭлементы());
	
КонецПроцедуры //ПриОткрытии()
